app/controllers/users_controller.rb

  def create
    #User.new(username: params["username"], email: params["email"], bio: params["bio"]).save
    #^Utiliser avec le <form>

    #@user = User.new(username: params["username"], email: params["email"], bio: params["bio"]).save
    #^Utiliser avec le <form_tag>

    @user = User.new(username: params["user"]["username"], email: params["user"]["email"], bio: params["user"]["bio"]).save
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "ospi"], ["email", "ospital.thierry@neuf.fr"], ["bio", "cool"], ["created_at", "2018-10-30 21:02:32.528144"], ["updated_at", "2018-10-30 21:02:32.528144"]]